---
kind: type
id: T:Autodesk.Revit.UI.Events.TextBoxEnterPressedEventArgs
source: html/1e00abfd-8c82-f8ab-4231-6dca5f85af77.htm
---
# Autodesk.Revit.UI.Events.TextBoxEnterPressedEventArgs

The event arguments used by TextBox's EnterPressed event.

## Syntax (C#)
```csharp
public class TextBoxEnterPressedEventArgs : RibbonItemEventArgs
```